КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Documents/ЗаказПоставщику/ЗаказПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8bd9f000-83c9-4a48-8166-2691b6f02183">
  <name>ЗаказПоставщику</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:Document>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/InformationRegisters/ОД_РассылкаПисемДатаДоставки/ОД_РассылкаПисемДатаДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОД_РассылкаПисемДатаДоставки</name>
  <resources>
    <name>Активно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСтарая</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНовая</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПоставщику</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Documents/ЗаказПоставщику/Forms/ФормаДокумента/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ОД_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)

	Если РольДоступна("Операционист")
		ИЛИ РольДоступна("МенеджерПоПродажамУправлениеРазделом")
		ИЛИ РольДоступна("РуководительОтделаПродажДополнительно") Тогда
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОД_ПередЗаписьюНаСервереПеред(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ОД_ОбщиеФункции.УправлениеАссортиментомДР(Отказ, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОД_ПередЗаписьюНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЛогСообщить("");
	ЛогСообщить(" - Запись документа: " + Объект.Ссылка);
	ЛогСообщить(" - Дата поступления старая: " + Формат(Объект.ДатаПервогоПоступления, "ДФ=dd.MM.yyyy") + ", новая: " + Формат(Объект.ДатаПоступления, "ДФ=dd.MM.yyyy"));

	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЛогСообщить(" - новый документ, не обрабатываем ");
		Возврат;
	КонецЕсли;
	
	Если Объект.ДатаПоступления = Объект.ДатаПервогоПоступления Тогда
		ЛогСообщить(" - не изменено ");
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаказКлиентаТовары.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|ГДЕ
		|	ЗаказКлиентаТовары.Ссылка.Склад = &Склад
		|	И ЗаказКлиентаТовары.Номенклатура В(&Номенклатура)
		|	И ЗаказКлиентаТовары.ВариантОбеспечения = &ВариантОбеспечения
		|	И ЗаказКлиентаТовары.ДатаОтгрузки = &ДатаОтгрузки
		|	И ЗаказКлиентаТовары.Ссылка.Дата >= &ДатаЗаказаПоставщику";
	
	Запрос.УстановитьПараметр("ДатаЗаказаПоставщику",	Объект.Дата);
	Запрос.УстановитьПараметр("ДатаОтгрузки",			Объект.ДатаПервогоПоступления);
	Запрос.УстановитьПараметр("Номенклатура",			Объект.Товары.Выгрузить().ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("Склад",					Объект.Склад);
	Запрос.УстановитьПараметр("ВариантОбеспечения",		Перечисления.ВариантыОбеспечения.ИзЗаказов);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Заказ = Выборка.Ссылка.ПолучитьОбъект();
		ЛогСообщить("    заказ клиента: " + Заказ.Ссылка);
		
		Для каждого Т Из Объект.Товары Цикл
			Отбор = Новый Структура("Номенклатура, ДатаОтгрузки, ВариантОбеспечения", Т.Номенклатура, Объект.ДатаПервогоПоступления, Перечисления.ВариантыОбеспечения.ИзЗаказов);
			НайденыСтроки = Заказ.Товары.НайтиСтроки(Отбор);
			Для каждого ТТ Из НайденыСтроки Цикл
				ЛогСообщить("" + Т.Номенклатура + ", " + "дата старая: " + Формат(ТТ.ДатаОтгрузки, "ДФ=dd.MM.yyyy") + ", новая: " + Формат(Объект.ДатаПоступления, "ДФ=dd.MM.yyyy"));
				ТТ.ДатаОтгрузки = Объект.ДатаПоступления;
			КонецЦикла;
		КонецЦикла;
		
		Попытка
			Заказ.Записать(РежимЗаписиДокумента.Проведение);
			ЛогСообщить(" проведен: " + Заказ.Ссылка);
		Исключение
			ЛогСообщить("! ошибка записи: " + Заказ.Ссылка);
			ЛогСообщить(ИнформацияОбОшибке());			
		КонецПопытки;
		
		СоздатьЗаписьДляРассылки(Объект.Ссылка, Выборка.Ссылка, Объект.ДатаПервогоПоступления, Объект.ДатаПоступления);
		
	КонецЦикла; 
	
   ИмяМетода = Метаданные.РегламентныеЗадания.ОД_РассылкаПисемДатаДоставки.ИмяМетода;

   // Проверка, выполняется ли фоновое задание по очистке устаревших версий.
   Отбор = Новый Структура;
   Отбор.Вставить("ИмяМетода", ИмяМетода);
   Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
   ФоновыеЗаданияОтправки = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
   Если ФоновыеЗаданияОтправки.Количество() = 0 Тогда
      НаименованиеФоновогоЗадания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
        НСтр("ru = 'Запуск программно: %1'"), Метаданные.РегламентныеЗадания.ОД_РассылкаПисемДатаДоставки.Синоним);
      ФоновыеЗадания.Выполнить(ИмяМетода,,, НаименованиеФоновогоЗадания);
		ЛогСообщить(" - запущено регл. задание рассылки писем");
   КонецЕсли;	
	
КонецПроцедуры 

#КонецОбласти

#Область РассылкаПисемИзмДатаПоступления

Процедура СоздатьЗаписьДляРассылки(п_ЗаказПоставщику, п_ЗаказКлиента, п_ДатаСтарая, п_ДатаНовая)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	    "ВЫБРАТЬ
	    |	ОД_РассылкаПисемДатаДоставки.ЗаказПоставщику КАК ЗаказПоставщику
	    |ИЗ
	    |	РегистрСведений.ОД_РассылкаПисемДатаДоставки КАК ОД_РассылкаПисемДатаДоставки
	    |ГДЕ
	    |	ОД_РассылкаПисемДатаДоставки.Активно
	    |	И ОД_РассылкаПисемДатаДоставки.ЗаказПоставщику = &ЗаказПоставщику
	    |	И ОД_РассылкаПисемДатаДоставки.ЗаказКлиента = &ЗаказКлиента
	    |	И ОД_РассылкаПисемДатаДоставки.Пользователь = &Пользователь";
	
	// для менеджера заказа
	Если ЗначениеЗаполнено(п_ЗаказКлиента.Менеджер) Тогда

		Запрос.УстановитьПараметр("ЗаказПоставщику",	п_ЗаказПоставщику);
		Запрос.УстановитьПараметр("ЗаказКлиента",		п_ЗаказКлиента);
		Запрос.УстановитьПараметр("Пользователь",		п_ЗаказКлиента.Менеджер);

		РезультатЗапроса = Запрос.Выполнить();

		Выборка = РезультатЗапроса.Выбрать();

		Если Выборка.Количество() = 0 Тогда
			НаборЗаписей = РегистрыСведений.ОД_РассылкаПисемДатаДоставки.СоздатьНаборЗаписей();

			НаборЗаписей.Отбор.Пользователь.Установить(п_ЗаказКлиента.Менеджер);

			НоваяЗапись = НаборЗаписей.Добавить();

			НоваяЗапись.ЗаказПоставщику	= п_ЗаказПоставщику;
			НоваяЗапись.ЗаказКлиента	= п_ЗаказКлиента;
			НоваяЗапись.Пользователь	= п_ЗаказКлиента.Менеджер;
			НоваяЗапись.Активно			= Истина;
			НоваяЗапись.ДатаСобытия		= ТекущаяДатаСеанса();
			НоваяЗапись.ДатаСтарая		= п_ДатаСтарая;
			НоваяЗапись.ДатаНовая		= п_ДатаНовая;

			Попытка
			    НаборЗаписей.Записать();		
			    ЛогСообщить(" - запись (менеджер): " + п_ЗаказПоставщику);
			    ЛогСообщить(" - запись (менеджер): " + п_ЗаказКлиента);
			    ЛогСообщить(" - запись (менеджер): " + п_ЗаказКлиента.Менеджер
			    	+ " " + Формат(п_ДатаСтарая, "ДФ=dd.MM.yyyy")
					+ " - " + Формат(п_ДатаНовая,  "ДФ=dd.MM.yyyy"));
			Исключение
			    ЛогСообщить("! Ошибка записи РС (менеджер): " + п_ЗаказПоставщику);
			    ЛогСообщить("! Ошибка записи РС (менеджер): " + п_ЗаказКлиента);
			    ЛогСообщить("! Ошибка записи РС (менеджер): " + п_ЗаказКлиента.Менеджер);
			КонецПопытки;
		КонецЕсли;

	Иначе
	    ЛогСообщить(" - " + п_ЗаказКлиента + " - " + "менеджер не заполнен");
	КонецЕсли;

	// для автора заказа	
	Если ЗначениеЗаполнено(п_ЗаказКлиента.Автор) Тогда

		Запрос.УстановитьПараметр("ЗаказПоставщику",	п_ЗаказПоставщику);
		Запрос.УстановитьПараметр("ЗаказКлиента",		п_ЗаказКлиента);
		Запрос.УстановитьПараметр("Пользователь",		п_ЗаказКлиента.Автор);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();

		Если Выборка.Количество() = 0 Тогда
			НаборЗаписей = РегистрыСведений.ОД_РассылкаПисемДатаДоставки.СоздатьНаборЗаписей();
			
			НаборЗаписей.Отбор.Пользователь.Установить(п_ЗаказКлиента.Автор);
			    
			НоваяЗапись = НаборЗаписей.Добавить();

			НоваяЗапись.ЗаказПоставщику	= п_ЗаказПоставщику;
			НоваяЗапись.ЗаказКлиента	= п_ЗаказКлиента;
			НоваяЗапись.Пользователь	= п_ЗаказКлиента.Автор;
			НоваяЗапись.Активно			= Истина;
			НоваяЗапись.ДатаСобытия		= ТекущаяДатаСеанса();
			НоваяЗапись.ДатаСтарая		= п_ДатаСтарая;
			НоваяЗапись.ДатаНовая		= п_ДатаНовая;

			Попытка
			    НаборЗаписей.Записать();		
			    ЛогСообщить(" - запись (автор): " + п_ЗаказПоставщику);
			    ЛогСообщить(" - запись (автор): " + п_ЗаказКлиента);
			    ЛогСообщить(" - запись (автор): " + п_ЗаказКлиента.Автор
			    	+ " " + Формат(п_ДатаСтарая, "ДФ=dd.MM.yyyy")
					+ " - " + Формат(п_ДатаНовая,  "ДФ=dd.MM.yyyy"));
			Исключение
			    ЛогСообщить("! Ошибка записи РС (автор): " + п_ЗаказПоставщику);
			    ЛогСообщить("! Ошибка записи РС (автор): " + п_ЗаказКлиента);
			    ЛогСообщить("! Ошибка записи РС (автор): " + п_ЗаказКлиента.Автор);
			КонецПопытки;
		КонецЕсли;
	Иначе
    	ЛогСообщить(" - " + п_ЗаказКлиента + " - " + "автор не заполнен");
	КонецЕсли;

КонецПроцедуры

Процедура ЛогСообщить(Знач М)

	ПолноеИмяФайла = "c:\log_1c\Рассылка писем дата поступления.txt";

	Попытка 
		ЛогФайл = Новый ЗаписьТекста(ПолноеИмяФайла, КодировкаТекста.ANSI,,Истина,);
		ЛогФайл.Записать(Формат(ТекущаяДата(),"ДЛФ=DT")+": " + М + Символы.ПС);
		ЛогФайл.Закрыть();
	Исключение
	Сообщить("ошибка записи лог файла");
	КонецПопытки;

КонецПроцедуры	
	
#КонецОбласти
